OdDAI.Iterator.previous
\details
Moves the iterator to the previous element of an aggregate relative to the current one.
The previous element becomes the current one unless the beginning of an aggregate is reached.
\returns
true if the move to the previous element was performed successfully; otherwise the method returns false.
The false value returned by the method means that the beginning of the aggregation container is reached and the iterator can not be moved anymore.
For example:
\code
for (it->end(); it->previous(); )
{
it->getCurrentMember()...
}
\remarks
Applicable for ordered aggregates (arrays, lists).

OdDAI.Iterator.next
\details
Moves the iterator to the next element of an aggregate relative to the current one.
The next element becomes the current one unless the end of an aggregate is reached.
\returns
true if the move to the next element was performed successfully; otherwise the method returns false.
The false value returned by the method means that the end of the aggregation container is reached and the iterator can not be moved anymore.
For example:
\code
for (it->beginning(); it->next(); )
{
it->getCurrentMember()...
}
\remarks
Applicable for ordered aggregates (arrays, lists).